modm-ext/archive-stmicro-svd/header_stm32h743agi6.svd
      <register>
        <name>BKP17R</name>
        <addressOffset>0x94</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BKP18R</name>
        <addressOffset>0x98</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BKP19R</name>
        <addressOffset>0x9c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BKP20R</name>
        <addressOffset>0xa0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BKP21R</name>
        <addressOffset>0xa4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BKP22R</name>
        <addressOffset>0xa8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BKP23R</name>
        <addressOffset>0xac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BKP24R</name>
        <addressOffset>0xb0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BKP25R</name>
        <addressOffset>0xb4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BKP26R</name>
        <addressOffset>0xb8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BKP27R</name>
        <addressOffset>0xbc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BKP28R</name>
        <addressOffset>0xc0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BKP29R</name>
        <addressOffset>0xc4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BKP30R</name>
        <addressOffset>0xc8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BKP31R</name>
        <addressOffset>0xcc</addressOffset>
        <size>0x20</size>
      </register>
    </peripheral>
    <peripheral>
      <name>IWDG1</name>
      <baseAddress>0x58004800</baseAddress>
      <register>
        <name>KR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>KEY</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PR</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RLR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>RL</name>
            <bitOffset>0</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SR</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PVU</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RVU</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WVU</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>WINR</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>WIN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
        </fields>
      </register>
    </peripheral>
    <peripheral>
      <name>SAI4</name>
      <baseAddress>0x58005400</baseAddress>
      <register>
        <name>GCR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SYNCIN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>SYNCOUT</name>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CR1A</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR1A</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR1A</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR1A</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR2A</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR2A</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR2A</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR2A</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FRCRA</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FRCRA</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FRCRA</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FRCRA</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SLOTRA</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SLOTRA</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SLOTRA</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SLOTRA</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR1B</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR1B</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR1B</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR1B</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR2B</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR2B</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR2B</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR2B</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IMRA</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IMRA</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IMRA</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IMRA</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FRCRB</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FRCRB</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FRCRB</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FRCRB</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SLOTRB</name>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SLOTRB</name>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SLOTRB</name>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SLOTRB</name>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SRA</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SRA</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SRA</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SRA</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>PDMCR</name>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PDMEN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MICNBR</name>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CKEN1</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CKEN2</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CKEN3</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CKEN4</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PDMDLY</name>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DLYM1L</name>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>DLYM1R</name>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>DLYM2L</name>
            <bitOffset>8</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>DLYM2R</name>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>DLYM3L</name>
            <bitOffset>16</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>DLYM3R</name>
            <bitOffset>20</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>DLYM4L</name>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>DLYM4R</name>
            <bitOffset>28</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IMRB</name>
        <addressOffset>0x4c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IMRB</name>
        <addressOffset>0x4c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IMRB</name>
        <addressOffset>0x4c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IMRB</name>
        <addressOffset>0x4c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CLRFRA</name>
        <addressOffset>0x58</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CLRFRA</name>
        <addressOffset>0x58</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CLRFRA</name>
        <addressOffset>0x58</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CLRFRA</name>
        <addressOffset>0x58</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SRB</name>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SRB</name>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SRB</name>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SRB</name>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DRA</name>
        <addressOffset>0x74</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DRA</name>
        <addressOffset>0x74</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DRA</name>
        <addressOffset>0x74</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DRA</name>
        <addressOffset>0x74</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CLRFRB</name>
        <addressOffset>0x78</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CLRFRB</name>
        <addressOffset>0x78</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CLRFRB</name>
        <addressOffset>0x78</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CLRFRB</name>
        <addressOffset>0x78</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DRB</name>
        <addressOffset>0x94</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DRB</name>
        <addressOffset>0x94</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DRB</name>
        <addressOffset>0x94</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DRB</name>
        <addressOffset>0x94</addressOffset>
        <size>0x20</size>
      </register>
    </peripheral>
    <peripheral>
      <name>GPIOA</name>
      <baseAddress>0x58020000</baseAddress>
      <register>
        <name>MODER</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MODE0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MODE1</name>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MODE2</name>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MODE3</name>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MODE4</name>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MODE5</name>
            <bitOffset>10</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MODE6</name>
            <bitOffset>12</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MODE7</name>
            <bitOffset>14</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MODE8</name>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MODE9</name>
            <bitOffset>18</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MODE10</name>
            <bitOffset>20</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MODE11</name>
            <bitOffset>22</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MODE12</name>
            <bitOffset>24</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MODE13</name>
            <bitOffset>26</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MODE14</name>
            <bitOffset>28</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MODE15</name>
            <bitOffset>30</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>OTYPER</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>OT0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OT1</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OT2</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OT3</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OT4</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OT5</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OT6</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OT7</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OT8</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OT9</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OT10</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OT11</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OT12</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OT13</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OT14</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OT15</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>OSPEEDR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>OSPEED0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSPEED1</name>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSPEED2</name>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSPEED3</name>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSPEED4</name>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSPEED5</name>
            <bitOffset>10</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSPEED6</name>
            <bitOffset>12</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSPEED7</name>
            <bitOffset>14</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSPEED8</name>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSPEED9</name>
            <bitOffset>18</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSPEED10</name>
            <bitOffset>20</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSPEED11</name>
            <bitOffset>22</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSPEED12</name>
            <bitOffset>24</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSPEED13</name>
            <bitOffset>26</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSPEED14</name>
            <bitOffset>28</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OSPEED15</name>
            <bitOffset>30</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
